## Tarea 1
##### Dataset de salarios (Científicos de datos)

https://www.kaggle.com/datasets/iamsouravbanerjee/data-science-salaries-2023

In [40]:
import pandas as pd
import matplotlib.pyplot as plt

df = pd.read_csv("Latest_Data_Science_Salaries.csv")
df.head(5)

,Job Title,Employment Type,Experience Level,Expertise Level,Salary,Salary Currency,Company Location,Salary in USD,Employee Residence,Company Size,Year
0,Data Engineer,Full-Time,Senior,Expert,210000,United States Dollar,United States,210000,United States,Medium,2023
1,Data Engineer,Full-Time,Senior,Expert,165000,United States Dollar,United States,165000,United States,Medium,2023
2,Data Engineer,Full-Time,Senior,Expert,185900,United States Dollar,United States,185900,United States,Medium,2023
3,Data Engineer,Full-Time,Senior,Expert,129300,United States Dollar,United States,129300,United States,Medium,2023
4,Data Scientist,Full-Time,Senior,Expert,140000,United States Dollar,United States,140000,United States,Medium,2023

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3300 entries, 0 to 3299
Data columns (total 11 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Job Title           3300 non-null   object
 1   Employment Type     3300 non-null   object
 2   Experience Level    3300 non-null   object
 3   Expertise Level     3300 non-null   object
 4   Salary              3300 non-null   int64
 5   Salary Currency     3300 non-null   object
 6   Company Location    3300 non-null   object
 7   Salary in USD       3300 non-null   int64
 8   Employee Residence  3300 non-null   object
 9   Company Size        3300 non-null   object
 10  Year                3300 non-null   int64
dtypes: int64(3), object(8)
memory usage: 283.7+ KB

In [4]:
df["Salary in USD"].describe()

count      3300.000000
mean     142095.983939
std       69028.235512
min       15000.000000
25%       90000.000000
50%      136000.000000
75%      185000.000000
max      450000.000000
Name: Salary in USD, dtype: float64

# Ejercicio en Clase:

Para este ejercicio debes realizar los siguientes pasos de manera anticipada los siguientes procesos:
- Cargar el conjunto de datos desde un archivo CSV utilizando pandas.
- Explorar y familiarizarse con la estructura del conjunto de datos.
- Calcular estadísticas descriptivas, como el promedio, la mediana y la desviación estándar, de variables relevantes del conjunto de datos general.

#### Acciones por ejecutar

1. ¿Cúantos posibles "Job Title" existen en el Dataset?
2. ¿Cúales son los "Employment Type" y en qué frecuencia se presentan en el Dataset?
3. ¿Cuáles son los "Expertise Level" y "Experience Level" y cuál es el salario promedio general de cada uno?
4. ¿Cuáles son los "Salary Currency" y a qué tasa está covertido respecto al dolar cada uno?
5. ¿En cuántos paises diferentes se encuentran los empleados ("Employee Residence")?
6. ¿Cuál salario promedio por "Job Title" agrupado?
7. ¿Cuál es el salario promedio por país de residencia (Employee Residence)?
8. ¿Cuál es el "Salary in USD" máximo y mínimo?¿A qué registro pertenece?
9. ¿Cuál es el salario promedio (en USD) por rol por tamaño de compañía?
10. muestre los datos agrupados por tamaño de la compañía, país y salario promedio.

### Propuesta de solución

In [41]:
%%time
import pandas as pd

# Cargar el dataset
df = pd.read_csv("Latest_Data_Science_Salaries.csv")

Wall time: 15.2 ms

In [43]:
# 1. ¿Cúantos posibles "Job Title" existen en el Dataset?
num_job_titles = df["Job Title"].nunique()
print("Número de posibles Job Titles:", num_job_titles, "tambien: ", len(df["Job Title"].unique()))
#df["Job Title"].unique()

Número de posibles Job Titles: 111 tambien:  111

In [8]:
# 2. ¿Cúales son los "Employment Type" y en qué frecuencia se presentan en el Dataset?
employment_types = df["Employment Type"].value_counts()
print("Employment Types y su frecuencia:")
print(employment_types)

Employment Types y su frecuencia:
Full-Time    3261
Contract       15
Part-Time      13
Freelance      11
Name: Employment Type, dtype: int64

In [44]:
# 2. ¿Cúales son los "Employment Type" y en qué frecuencia se presentan en el Dataset?
company_size = df["Company Size"].value_counts()
print(company_size)

Medium    2707
Large      442
Small      151
Name: Company Size, dtype: int64

In [45]:
#3. ¿Cuáles son los "Expertise Level" y "Experience Level" y cuál es el salario promedio general de cada uno?
expertise_level_salary = df.groupby("Expertise Level")["Salary in USD"].mean()
print("Salario promedio por Expertise Level:")
print(expertise_level_salary)

Salario promedio por Expertise Level:
Expertise Level
Director        191512.143836
Expert          160277.513317
Intermediate    108714.977415
Junior           79921.479452
Name: Salary in USD, dtype: float64

In [50]:
df_filter = df[ ["Expertise Level", "Experience Level", "Salary in USD"] ]

dfb = df_filter.groupby("Expertise Level").agg({"Salary in USD":"mean"})
dfb
#dfb = df_filter.groupby("Expertise Level").agg( salario_promedio = ('Salary in USD', 'mean') )
#dfb
# Renombrado
#dfb.rename({"Salary in USD" : "Salario Promedio"}, inplace=True)
#dfb
df_filter.groupby(["Expertise Level","Experience Level"])["Salary in USD"].mean()

Expertise Level  Experience Level
Director         Executive           191512.143836
Expert           Senior              160277.513317
Intermediate     Mid                 108714.977415
Junior           Entry                79921.479452
Name: Salary in USD, dtype: float64

In [49]:
experience_level_salary = df.groupby("Experience Level")["Salary in USD"].mean()
print("Salario promedio por Experience Level:")
print(experience_level_salary)

Salario promedio por Experience Level:
Experience Level
Entry         79921.479452
Executive    191512.143836
Mid          108714.977415
Senior       160277.513317
Name: Salary in USD, dtype: float64

In [55]:
# 4. ¿Cuáles son los "Salary Currency" y a qué tasa está convertido respecto al dolar cada uno?
##################### 
df["Currency Rate"] = (df["Salary"]/df["Salary in USD"]).astype("float16")
df_currency_rate = df.groupby(["Salary Currency"]).agg({"Currency Rate":"mean"})
df_currency_rate = pd.DataFrame(df_currency_rate["Currency Rate"])
df_currency_rate = df_currency_rate.sort_values(by="Currency Rate", ascending=False)
#df_currency_rate
df_currency_rate.index.unique()

Index(['Chilean Peso', 'Hungarian Forint', 'Japanese Yen', 'Indian Rupee',
       'Philippine Peso', 'Thai Baht', 'Mexican Peso', 'South African Rand',
       'Turkish Lira', 'Norwegian Krone', 'Hong Kong Dollar', 'Danish Krone',
       'Brazilian Real', 'Polish Zloty', 'Israeli New Shekel',
       'Australian Dollar', 'Singapore Dollar', 'Canadian Dollar',
       'United States Dollar', 'Swiss Franc', 'Euro',
       'British Pound Sterling'],
      dtype='object', name='Salary Currency')

In [56]:
# 5. ¿En cuántos paises diferentes se encuentran los empleados ("Employee Residence")?
num_countries = df["Employee Residence"].nunique()
print("Número de países diferentes en Employee Residence:", num_countries)

Número de países diferentes en Employee Residence: 83

In [72]:
# 6. ¿Cuál salario promedio por "Job Title" agrupado?
job_title_avg_salary = df.groupby("Job Title")["Salary in USD"].mean()
print("Salario promedio por Job Title:")
#print(job_title_avg_salary)

df_sorted = pd.DataFrame(job_title_avg_salary).sort_values(by="Salary in USD", ascending=True)

df_sorted["Salary in USD"].apply(lambda x: '{:,.0f}'.format(x).replace(",","."))

Salario promedio por Job Title:

Job Title
Data Quality Engineer              23.753
Principal Data Architect           38.154
Compliance Data Analyst            45.000
Data Engineer 2                    46.565
Insight Analyst                    47.370
                                   ...
Cloud Data Architect              250.000
AWS Data Architect                258.000
Managing Director Data Science    300.000
Data Science Tech Lead            375.000
Analytics Engineering Manager     399.880
Name: Salary in USD, Length: 111, dtype: object

In [62]:
# 7. ¿Cuál es el salario promedio por país de residencia (Employee Residence)?
residence_avg_salary = df.groupby("Employee Residence")["Salary in USD"].mean()
print("Salario promedio por país de residencia:")
print(residence_avg_salary)

Salario promedio por país de residencia:
Employee Residence
Algeria                 100000.000000
American Samoa           45555.000000
Andorra                  50745.000000
Argentina                56444.444444
Armenia                  50000.000000
                            ...
United Arab Emirates    100000.000000
United Kingdom          109147.424490
United States           159794.726050
Uzbekistan               82000.000000
Viet Nam                 44200.000000
Name: Salary in USD, Length: 83, dtype: float64

In [74]:
# 8. ¿Cuál es el "Salary in USD" máximo y mínimo? ¿A qué registro pertenece?
max_salary = df["Salary in USD"].max()
#print(max_salary)
max_salary_rows = df[ df["Salary in USD"] == max_salary ]
print("Salario máximo:", max_salary)
print("Registro correspondiente al salario máximo:")
max_salary_rows

Salario máximo: 450000
Registro correspondiente al salario máximo:

,Job Title,Employment Type,Experience Level,Expertise Level,Salary,Salary Currency,Company Location,Salary in USD,Employee Residence,Company Size,Year,Currency Rate
3085,Research Scientist,Full-Time,Mid,Intermediate,450000,United States Dollar,United States,450000,United States,Medium,2020,1.0

In [75]:
min_salary = df["Salary in USD"].min()
min_salary_rows = df[ df["Salary in USD"] == min_salary ]
print("Salario mínimo:", min_salary)
print("Registro correspondiente al salario mínimo:")
min_salary_rows

Salario mínimo: 15000
Registro correspondiente al salario mínimo:

,Job Title,Employment Type,Experience Level,Expertise Level,Salary,Salary Currency,Company Location,Salary in USD,Employee Residence,Company Size,Year,Currency Rate
1335,Staff Data Analyst,Full-Time,Executive,Director,15000,United States Dollar,Canada,15000,Nigeria,Medium,2020,1.0
2641,Machine Learning Developer,Full-Time,Entry,Junior,15000,United States Dollar,Thailand,15000,Thailand,Large,2021,1.0
2826,Data Analyst,Full-Time,Entry,Junior,15000,United States Dollar,Indonesia,15000,Indonesia,Large,2022,1.0

In [94]:
# ¿Cuál es el salario promedio (en USD) por rol por tamaño de compañía?
avg_salary_by_role_size = df.groupby(["Job Title", "Company Size"]).agg({"Salary in USD":"mean"})
print("Salario promedio por rol y tamaño de compañía:")
avg_salary_by_role_size

Salario promedio por rol y tamaño de compañía:

                                              Salary in USD
Job Title                       Company Size
AI Architect                    Large              207968.0
                                Medium             267000.0
AI Developer                    Large              215936.0
                                Medium              97944.0
                                Small              197500.0
...                                                     ...
Software Data Engineer          Medium              50000.0
Staff Data Analyst              Medium              15000.0
                                Small              179998.0
Staff Data Scientist            Medium             134500.0
Staff Machine Learning Engineer Medium             185000.0

[204 rows x 1 columns]

In [97]:
# 10. muestre los datos agrupados por tamaño de la compañía, país y salario promedio.
grouped_data = df.groupby(["Company Size","Company Location"])["Salary in USD"].mean()
print("Datos agrupados por tamaño de compañía, país y salario promedio:")
pd.DataFrame(grouped_data)

Datos agrupados por tamaño de compañía, país y salario promedio:

                                   Salary in USD
Company Size Company Location
Large        American Samoa         50000.000000
             Argentina              50000.000000
             Australia              87307.444444
             Austria                75141.666667
             Belgium                84053.000000
...                                          ...
Small        Turkey                 20000.000000
             Ukraine                50000.000000
             United Arab Emirates   92500.000000
             United Kingdom         95451.333333
             United States         113025.087719

[135 rows x 1 columns]